{"posts":[{"title":"Factory to make blades as part of £1bn deal","description":"A Hull factory will supply wind turbine blades for Scottish Power in a contract worth more than £1bn.\n\nSiemens Gamesa will manufacture the blades for 64 turbines, which will be installed at the East Anglia TWO windfarm off the Suffolk coast.\n\nDarren Davidson, UK head of Siemens Energy and Siemens Gamesa, said the deal would allow the firm to plan for the long term in Hull and was a \"real positive\" for job security.\n\nCharlie Jordan, chief executive of Scottish Power Renewables, said the £4bn windfarm would provide enough green energy to power more than a million homes.\n\nThe Hull factory employs about 1,300 people, having recruited more than 600 over the past 12 months.\n\nEngineering apprentices Charlotte Harber, 18, and Dane Glenn, 21, are among young people building careers at the plant.\n\nMr Glenn said it meant \"quite a lot” to be part of a team helping to provide clean energy for the country.\n\n\"It's providing for the next generation,\" he added.","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/d978/live/86cfbfc0-a029-11ef-95d1-9d950a2263c3.jpg.webp","date":"2024-11-04","id":"47217680-22de-48c2-b016-b950b0745ad1"},{"title":"Factory to make blades as part of £1bn deal","description":"A Hull factory will supply wind turbine blades for Scottish Power in a contract worth more than £1bn.\n\nSiemens Gamesa will manufacture the blades for 64 turbines, which will be installed at the East Anglia TWO windfarm off the Suffolk coast.\n\nDarren Davidson, UK head of Siemens Energy and Siemens Gamesa, said the deal would allow the firm to plan for the long term in Hull and was a \"real positive\" for job security.\n\nCharlie Jordan, chief executive of Scottish Power Renewables, said the £4bn windfarm would provide enough green energy to power more than a million homes.\n\nThe Hull factory employs about 1,300 people, having recruited more than 600 over the past 12 months.\n\nEngineering apprentices Charlotte Harber, 18, and Dane Glenn, 21, are among young people building careers at the plant.\n\nMr Glenn said it meant \"quite a lot” to be part of a team helping to provide clean energy for the country.\n\n\"It's providing for the next generation,\" he added.","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/d978/live/86cfbfc0-a029-11ef-95d1-9d950a2263c3.jpg.webp","date":"2024-11-04","id":"578588a6-53a7-4d8f-a79b-2e024486cfbc"},{"title":"Ukraine in maps: Tracking the war with Russia 2 hours ago  Share  Save the Visual Journalism Team BBC News","description":"Fighting has raged in Ukraine since Russia launched a full-scale invasion in February 2022. Russian forces have slowly expanded the amount of territory they control over the last year, mostly in the east of Ukraine, but Ukrainian forces have made those advances as slow and difficult as possible and even staged a counter-offensive into Russian territory.","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/12767/production/_133532657_ukraine-russia-promo.png.webp","date":"2024-11-19","id":"36559f31-28cd-4ea5-a5c1-893cc3564599"},{"title":"Ukraine fires US-supplied long range missiles into Russia, defence ministry says","description":"Russia says Ukraine has fired US-supplied long-range missiles into the country, a day after Washington gave its permission for such attacks.\n\nUkraine used the Army Tactical Missile System (Atacms) in a strike on Russia's Bryansk region this morning, the ministry of defence in Moscow said.\n\nFive missiles were shot down and one damaged, with its fragments causing a fire at a military facility in the region, it said in a statement.\n\nThe strike represents the first time the long-range missiles have been used on Russia's internationally-recognised territory and comes shortly after Washington signalled Ukraine had permission to fire the Atacms into Russia.\n\nOn Monday Moscow said any such attack would prompt an \"appropriate and tangible response\".\n\nUkraine has already been using Atacms in Russian-occupied areas of its territory for more than a year.\n\nThe missiles can hit targets at a range of up to 300km (186 miles) and are difficult to intercept.\n\nKyiv is now able to strike deeper into Russia using the missiles, including around the Kursk region, where Ukrainian forces hold over 1,000 sq km of territory. Ukrainian and US officials reportedly expect a counter-offensive in the region.","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/de39/live/f4e98b40-a677-11ef-9594-01270c2bfaac.jpg.webp","date":"2024-11-21","id":"1f12e22e-e178-4456-a394-dbab514ce02b"},{"title":"Myanmar","description":"မြန်မာ့အိမ်နီးချင်း အင်အားကြီးနိုင်ငံတွေဖြစ်သလို စစ်ကောင်စီနဲ့ သံတမန်ရေးနီးစပ်တဲ့ တရုတ်၊ အိန္ဒိယနဲ့ ရုရှားနိုင်ငံတို့ ပါဝင်နေတဲ့ BRICS ထိပ်သီးဆွေးနွေးပွဲကို ရုရှားနိုင်ငံ၊ ခါဆန်မြို့မှာ ကျင်းပနေပါတယ်။\n\nရုရှားသမ္မတ ဗလာဒီမီယာ ပူတင်က ဦးဆောင်ကျင်းပပြီး အိန္ဒိယဝန်ကြီးချုပ် နာရန်ဒြာမိုဒီ နဲ့ တရုတ်သမ္မတ ရှီကျင့်ဖျင်တို့ ကိုယ်တိုင်တက်ရောက်တဲ့ ဒီထိပ်သီးဆွေးနွေးပွဲဟာ အမေရိကန်အပါအဝင် အနောက်ရဲ့ ဖိအား အလုပ်မဖြစ်ဘူးဆိုတာကို ပြသရာလည်း ရောက်နေပါတယ်။\n\nကမ္ဘာ့နိုင်ငံပေါင်း ၂၀ ကျော်က နိုင်ငံ့ခေါင်းဆောင်တွေလည်း တက်ရောက်တဲ့ ဒီထိပ်သီးဆွေးနွေးပွဲဟာ ရုရှားမှာ ‘’အကြီးမားဆုံးနိုင်ငံခြားရေးမူဝါဒဆိုင်ရာပွဲတွေထဲတစ်ခု’’ လို့ ကလင်မလင်နန်းတော်ဘက်က ပြောပါတယ်။\n\nဘရာဇီး၊ ရုရှား၊ အိန္ဒိယ၊ တရုတ်နဲ့ တောင်အမေရိကတို့ရဲ့ ဖွဲ့စည်းထားတဲ့ BRICS အဖွဲ့ဟာ စီးပွားရေးထွန်းသစ်စနိုင်ငံတွေကို နိုင်ငံတကာစင်မြင့် နိုင်ငံရေးမှာ ပိုပြီး ပါဝင်လာစေဖို့ ရည်ရွယ်ပါတယ်။\n\nအခုတော့ အဖွဲ့ဝင် သစ်တွေတိုးလာနေတဲ့ BRICS မှာ မြန်မာစစ်ကောင်စီကလည်း အဖွဲ့ဝင်အဖြစ် ပါဝင်နိုင်ဖို့ ခြေလှမ်းနေပါတယ်။","image":"https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/6c20/live/c603d550-9200-11ef-9140-af626246800c.jpg.webp","date":"2024-11-06","id":"54d059cb-cbfc-4d2d-87a5-b01ebbd6ef64"}]}